## Importing libaries
These libraries are built-in with the anaconda suite

In [1]:
import pandas as pd
import sqlite3

# Reading sample data into pandas DFs
The sample data is about movie titles, ratings and reviews from the Movie Lens dataset here: <br>
http://files.grouplens.org/datasets/movielens/ml-latest-small.zip

In [2]:
df1 = pd.read_csv('../sample_data/ml-latest-small/movies.csv', index_col=0) 
df1.head()

,title,genres
movieId,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
3,Grumpier Old Men (1995),Comedy|Romance
4,Waiting to Exhale (1995),Comedy|Drama|Romance
5,Father of the Bride Part II (1995),Comedy

In [3]:
df2 = pd.read_csv('../sample_data/ml-latest-small/ratings.csv', index_col=1) 
df2.head()

         userId  rating  timestamp
movieId
1             1     4.0  964982703
3             1     4.0  964981247
6             1     4.0  964982224
47            1     5.0  964983815
50            1     5.0  964982931

In [4]:
df3 = pd.read_csv('../sample_data/ml-latest-small/tags.csv', index_col=1) 
df3.head()

         userId              tag   timestamp
movieId
60756         2            funny  1445714994
60756         2  Highly quotable  1445714996
60756         2     will ferrell  1445714992
89774         2     Boxing story  1445715207
89774         2              MMA  1445715200

# Loading the data into SQLite

## Create a DB with `connect()`

In [5]:
db = sqlite3.connect('../sample_data/ml-latest-small_sqlite.db')

## Writing data to DB
Write records stored in a DataFrame to a SQL database. <br>
Tables can be newly created, appended to, or overwritten.

In [6]:
df1.to_sql('ml-movies', db, if_exists='replace')
df2.to_sql('ml-ratings', db, if_exists='replace')
df3.to_sql('ml-tags', db, if_exists='replace')

## Commit changes and close DB

In [7]:
db.commit()
db.close()